# 3.Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.

# *Пример:*

# - Для n = 6: {1: 2, 2: 2.25, 3: 2.37, 4: 2.44, 5: 2.49, 6: 2.52}

n = int(input('Введите число: '))
a = []
b = 1
sum = 0
for i in range(1, n+1):
    b = (1+(1/i))**i
    a.append(round(b, 2))
    sum = sum + b
print(a)
print(round(sum, 3))